Revit 2027 API
ParameterTypeId.ViewerSheetName Property
 "Sheet Name"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewerSheetName { get; }
Public Shared ReadOnly Property ViewerSheetName As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewerSheetName {
	ForgeTypeId^ get ();
}
static member ViewerSheetName : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace